{
  "status": {
    "body": "Today, things are mostly fine. I'm mostly healed up from all the tooth extractions. I'm starting radiation soon, and I'm kind of dreading that whole process. Therapy is helping, but bringing up difficult issues kind of sucks.",
    "lastUpdated": "February 2026"
  },
  "entries": [
    {
      "date": "June 2018",
      "title": "Cancerous Beginnings",
      "body": [
        "When I first discovered something was going on we were on a mini vacation and at first it seemed like it was an ingrown hair or something that would resolve itself. Years passed and it grew in size and eventually sometimes started to bleed. I would stop the bleeding, and clean it up and it would be good until next time.",
        "During this period it was becoming increasingly annoying when people asked questions about what was on my face, so I grew a beard. That was around early 2020 so wearing a mask was partly helping to hide a growth and a growing beard. It was all a success because the questions stopped."
      ]
    },
    {
      "date": "September 2025",
      "title": "A Wild Lump has appeared",
      "body": [
        "In the early part of the month, I noticed something new. It was a lump on my neck near where the thing on my face was. At first the new thing was just a tiny lump, so I checked it each day for any changes. One thing that I discovered was if I pushed on it I would get a bit light headed. So obviously it was a problem and after a week of it growing in size and becoming more firm, I alerted my wife. We made an appointment with our primary who examined the old thing, the new thing, and other things deemed as problem areas and sent off referrals for us to see specialists."
      ]
    },
    {
      "date": "October 2025",
      "title": "Testing & Diagnosis",
      "body": [
        "We were sent to a dermatologist who immediately identified it as skin cancer, but wasn’t sure if it was a Basal Cell Carcinoma or a Squamous Cell Carcinoma. Regardless, he was doing a biopsy of the thing on my cheek that day. With a scalpel he took a chunk of it out and sent it off to a lab.",
        "We were also sent to an ENT, and that following monday we met him where he also did a biopsy, but it was on the new lump on my neck. In that office as the second biopsy was being done a flood of emotions washed over me as I realized how much i’d fucked up.",
        "Following the Biopsies, the whole area between the old thing and the new thing was incredibly pissed off. The old thing had never presented with pain, it would just bleed sometimes, and the new thing didn’t hurt me until I pushed on it too hard. But now they were both angry and causing pain.",
        "My ENT sent me for a CT Scan of the neck and face. I also was scheduled for what was called a Mohs procedure on a Friday, which as it was described by the dermatologist was a procedure where they shaved off layers of tissue and checked them to see if they needed to take more skin tissue. The night before I shaved off my beard, the beard I'd had for years as my social protection. It felt like I lost a part of my identity because it was a magnificent beard. We never had that procedure done because when they saw how big the lesion on my face was and learned that there was a lump they cancelled the procedure.",
        "We saw my ENT the following Tuesday and he was not surprised they refused to do the procedure. We still didn’t know exactly what it was because what I was being told is that a Basal Cell Carcinoma doesn’t really spread like that. My ENT was really aggressive with figuring out what it was and scheduled me for a PET scan, a CT with and without contrast, an MRI with and without contrast, and more labwork. Before I could get them though, I had to endure having all those tests declined by my medical insurance. And I swear I heard the lady on the phone chuckle as she was telling me they were declined. Apparently, this is a normal thing because I alerted my ENTs office and they submitted some additional paperwork or my ENT talked to them on the phone or something else because the tests were then approved.",
        "The week of the tests was rough because getting all those tests done in such a short span is taxing physically, mentally, and emotionally."
      ]
    },
    {
      "date": "November 2025",
      "title": "Mass Removal & New Bad News",
      "body": [
        "We saw my ENT that following Monday for results and he still wasn’t really calling the new lump by a specific name and was being intentionally vague. It didn’t really matter if it had a name because it was getting evicted anyway. However, it needed a name, so I figured that since nearly every Steve I've ever encountered has been a giant douche canoe, I would just name it Steve.",
        "The first half of November was rather uneventful with most of it being back and forth between the ENT and the plastic surgeon to hammer out the date for surgery. We registered for surgery on my birthday and the surgery was shortly after. The surgery was scheduled to be my ENTs last case for the day so he could spend time getting everything out without feeling rushed.",
        "Surgery started around 1p and it was odd because usually the anesthesiologist tells you to count backwards from or towards 10 and only lets you get a couple numbers, but this time i made it all the way to 10. The next thing I remember is waking up in my hospital room and asking for my wife. Some time had passed after I woke up and they finally had contacted her to let her know where I was. She saw me and ran towards the bed and got in it with me and was nearly in hysterics. I had no idea how long the surgery was or even what time it was, but having her was the best part. Well, until we set off the bed alarm because I'd gained weight all of a sudden from her sitting in the bed with me. The nurses all rushed in confused and saw what was happening and turned the bed alarm off. I was still in excruciating pain from surgery and was told they didn’t have any orders for medicine for me.",
        "I’m going to back up a bit, because from my wife’s perspective it’s a bit different. They took me for surgery and had her hang out in the waiting area and after almost 5 hours my ENT went to talk to her to let her know that his part was finished and that the plastic surgeon was closing me up. Once the plastic surgeon was done he found her as well and brought a picture to show her how extensive it was. So for my wife it was quite scary because it was taking a lot longer than she thought, but neither of us really knew how long it was supposed to take.",
        "That catches us up from my account and her account, so after she got off my bed and was making sure i was good. She called my ENT to let him know that the nurses said there were no orders for me and that I was starting to hurt a lot. He called the nurses desk and chewed them out because he’d put the orders in before surgery because he knew what I was going to go through. They found the orders and then started bringing in meds for me. The morphine helped at first but wore off within the hour. I mentioned this to my wife and she told the nurse and I got more morphine, which again wore off after an hour.",
        "I had my wife take a picture of my face and once i wasn’t as loopy i was able to count that there were 50-60 stitches from what i could see. She then told me that she had already spoken to my ENT and he explained to her that he wasn't sure if he got it all. He said that the margins were low enough that he could stop taking facial tissue, but still high enough that he couldn't confidently say he got it all. After that she then told me that I had to have all my teeth removed because of radiation.",
        "I remember feeling extremely angry and scared for how I would be able to feed myself. I calmed down and we started planning for that future.",
        "In the hospital, and for a few days after we got home I ate soft foods because of the placement of the stitches. I'm not posting a picture, but the top incision runs from a quarter of an inch near the corner of my mouth to about an inch to the bottom of my ear. The bottom incision starts from the middle of my ear in the crease next to my sideburns and takes a path down that crease and under my ear to the hairline behind my ear and then down neck to a nearly horizontal path to my Adams apple.",
        "I also had a drain tube coming out of my neck near the collar bone. That tube went up my neck and felt like it was behind my ear. On the end of the tube was a flexible bulb that had to be emptied periodically. It was a giant pain in the neck.",
        "We spoke to both the ENT and the plastic surgeon multiple times over the two days we were there. Through those conversations we learned more about the masses that were removed. They were both Basal Cell Carcinomas. The BCC on my cheek was huge. It was about an inch and a half around. The BCC on my neck was a bit smaller at around an inch around, but it was also wrapped around the parotid. The ENT took the BCC off and performed a parotidectomy. He explained that he took most of it and left the anterior portion of it, and that he also took like 9 lymph nodes out as well.",
        "I asked the plastic surgeon how many stitches he used and told him I'd counted about 50-60 stitches. He said he lost count and that there were hundreds of stitches in multiple layers under the skin.",
        "The nurses for my stay had to put new bactrim every 4-6 hours. They never wiped the old bactrim off and just applied the new on top. I stared at that picture of my face for days as I started talking to friends and family and showing everyone my new face.",
        "Once we got home, we kept applying the bactrim. My wife helped me bathe and that was really nice because I hadn't been able to get very clean because I couldn't really get much around my neck wet. That drain tube was the most difficult thing to deal with. One time, I dropped it and it tugged on the stitch that was holding it in place, and I saw stars. I then had the idea that I would use a lanyard with a badge clip to hold it up so it wouldn't get dropped. That was a game changer because now I could carry two things instead of the bulb and one thing.",
        "A week after surgery we saw my ENT and plastic surgeon. My ENT said I was looking good and that he was happy about the progress. That same trip back to the hospital we saw the plastic surgeon and he pulled half the stitches out. The drain tube was also removed, and just so happened to be the absolute strangest feeling I've ever had.",
        "Thanksgiving was different because I still couldn't open my mouth very wide and long trips were tricky, but I was prepared to put my whole plate in the blender and puree it if I had to."
      ]
    }
  ]
}
